[
    {
        "up": 0,
        "id": 3,
        "index": 0,
        "name": "_users"
    },
    {
        "up": 3,
        "id": 20,
        "index": "",
        "name": "admin",
        "passwordMd5": "202cb962ac59075b964b07152d234b70",
        "hint": "password = 123"
    },
    {
        "up": 0,
        "id": 27,
        "index": "",
        "name": "products"
    },
    {
        "up": 0,
        "id": 28,
        "index": "",
        "name": "banner",
        "image": "@/riflecore.jpg",
        "comment": "Evolving AI has untapped potential for bringing engaging interactions with virtual characters. At every step of the way we find new opportunities for applying our stack to new fields within games, social and entertainment products."
    },
    {
        "up": 0,
        "id": 29,
        "index": "",
        "name": "vacancies"
    },
    {
        "up": 27,
        "id": 30,
        "index": "",
        "name": "01",
        "title": "fluxCortex",
        "tags": "#ai #evolvingai #virtualbeings",
        "description": "<p>\r\n<b>fluxCortex Azu®</b> — next-generation Evolving AI hybrid architecture based on genetic algorithms and reinforcement learning.\r\n</p>\r\n<p>\r\nVirtual Beings solution for natural interaction with emotional feedback and ability for real-time acquisition of skills.\r\n</p>",
        "url": "fluxcortex",
        "page": ""
    },
    {
        "up": 27,
        "id": 31,
        "index": "",
        "name": "02",
        "title": "fluxNEAT",
        "tags": "#ai #genetic #bots #npc",
        "description": "<p>\r\n<b>fluxNEAT®</b> — evolving Neural Networks solution capable of learning skills in real-time with zero to minimal pre-training data.\r\n</p>\r\n<p>\r\nSelf-learning system for application in games providing human-like, evolving behaviors of computer-controlled characters.\r\n</p>",
        "url": "fluxneat"
    },
    {
        "up": 27,
        "id": 32,
        "index": "",
        "name": "03",
        "title": "Riflecore",
        "tags": "#gamedevelopment #onlinegame #brawler",
        "description": "<p>\r\n<b>Riflecore</b> fuses brawling fundamentals with tactical gunplay. Take map control with your teammates and demolish the enemies in a truly competitive way.\r\n</p>\r\n\r\n<p>\r\nYour victories and choices will shape the tides of the ongoing hybrid war on the world map, and decide the fate of key characters with each new season rollout.\r\n</p>",
        "page": "\r\n\t\t\t\t<p><b>Riflecore</b> fuses brawling fundamentals with tactical gunplay. Take map control with your teammates and demolish the enemies in a truly competitive way.</p>\r\n\t\t\t\t<p>Your victories and choices will shape the tides of the ongoing hybrid war on the world map, and decide the fate of key characters with each new season rollout.</p>\r\n\t\t\t\t<p><img src=\"assets/images/riflecore.jpg\" alt=\"Riflecore\"></p>\r\n\t\t\t\t<p class=\"list_heading\"></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Precision and drive sculpted for the competitive online gaming scene</li>\r\n\t\t\t\t\t<li>Crisp hand-drawn line art graphics infused with modern rendering tech</li>\r\n\t\t\t\t\t<li>AI companions with customizable behaviors driven by groundbreaking evolving neural networks technology</li>\r\n\t\t\t\t\t<li>Meta game — each fight leaves a mark on the world map, engaging players in a global tug of war for influence</li>\r\n\t\t\t\t\t<li>Seasonal story mode where players get to defend their narrative decisions on a worldwide scale</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<!--<a href=\"#\" class=\"submit\">Visit we",
        "url": "riflecore"
    },
    {
        "up": 29,
        "id": 33,
        "index": "",
        "name": "01",
        "title": "C++ Core Engineer",
        "tags": "#engineering #full-time #remote #fluxcortex",
        "description": "Experienced C++ engineer for development of core artificial intelligence technology framework and integration modules.",
        "page": "<p class=\"list_heading\"><b>Responsibilities:</b></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Take part in design and develop core artificial intelligence technology framework and integration modules</li>\r\n\t\t\t\t\t<li>Deploy machine learning models to the cloud</li>\r\n\t\t\t\t\t<li>Analyze, profile and optimize AI technology stack</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<p class=\"list_heading\"><b>Requirements:</b></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Strong C++ coding and software engineering skills</li>\r\n\t\t\t\t\t<li>Strong understanding of computer science data structures and algorithms</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<p class=\"list_heading\"><b>Nice to have:</b></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Experience with neural networks and artificial intelligence development</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<p><b>Apply:</b></p>\r\n\t\t\t\t<p><a href=\"mailto:job@temporal.games\" class=\"mailto\">job@temporal.games</a></p>",
        "url": "core_engineer"
    },
    {
        "up": 29,
        "id": 34,
        "index": "",
        "name": "02",
        "title": "VFX Artist",
        "tags": "#techart #remote #riflecore",
        "description": "Specialist capable of designing and implementing highly stylized visual effects, improving tools and optimizing pipelines.",
        "url": "vfx_artist",
        "page": "\t\t\t\t<p>Join us as a versatile visual effects artist specialized in creation of stylised and captivating visual effects fit for Riflecore’s artistic vision, utilizing already designed solutions and further develop an approach for our visual effects. Become a part of our art team, work under supervision and in collaboration with the project's Art-Director and Technical Artist.</p>\r\n\t\t\t\t<p class=\"list_heading\"><b>Responsibilities:</b></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Forming a stylistic approach to VFX for a brawler-like game reliant on clear visual feedback</li>\r\n\t\t\t\t\t<li>Collaborating and communicating with the entire game development team to ensure cohesion between game mechanics and visual effects</li>\r\n\t\t\t\t\t<li>Producing high-quality stylized animated effects</li>\r\n\t\t\t\t\t<li>Managing the balance between quality and resources available for the best game experience</li>\r\n\t\t\t\t\t<li>Participating in planning, organizing and following the delivery plan on your own tasks</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<p class=\"list_heading\"><b>Requirements:</b></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>A portfolio containing in-engine works of high quality visual effects</li>\r\n\t\t\t\t\t<li>Capability of delivering artistic and technical ideas to the entire team and to the technical artist</li>\r\n\t\t\t\t\t<li>Knowledge of essential techniques and design principles of visual effects in traditional animation</li>\r\n\t\t\t\t\t<li>Experience in designing a combination of hand-drawn, particle and code based (affected by shaders) visual effects</li>\r\n\t\t\t\t\t<li>Understanding essentials of Unity game engine or at least strong experience with other game engines, like Unreal Engine</li>\r\n\t\t\t\t\t<li>Capability of working with and setting up materials and prefabs, post-processing</li>\r\n\t\t\t\t\t<li>Understanding of particle effects-based workflows</li>\r\n\t\t\t\t\t<li>Understanding of modeling and texturing</li>\r\n\t\t\t\t\t<li>Fundamental understanding of shaders, the way modern day graphics function from concept to implementation and optimisation</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<p><b>Apply:</b></p>\r\n\t\t\t\t<p><a href=\"mailto:job@temporal.games\" class=\"mailto\">job@temporal.games</a></p>"
    },
    {
        "up": 29,
        "id": 35,
        "index": "",
        "name": "03",
        "title": "UI Designer",
        "tags": "#ui #ux #gui #remote #riflecore",
        "description": "Experienced UI/UX designer with a portfolio of game projects, capable of conceptualizing and implementing UI for Riflecore.",
        "url": "ui_designer",
        "page": "<p>Experienced UI/UX designer with a portfolio of game projects, capable of both conceptualizing and implementing UI for Riflecore.</p>\r\n\t\t\t\t<p class=\"list_heading\"><b>Responsibilities:</b></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>High-level planning of Riflecore’s UI systems</li>\r\n\t\t\t\t\t<li>Designing overall flow of user experience accommodating various Riflecore’s modes and experiences</li>\r\n\t\t\t\t\t<li>Ensuring the UI is designed in unison with the game’s art direction</li>\r\n\t\t\t\t\t<li>Production and implementation of UI assets</li>\r\n\t\t\t\t\t<li>Assessing feedback and fine tuning user experience</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<p class=\"list_heading\"><b>Requirements:</b></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Demonstrated UI/UX design experience in shipped game products</li>\r\n\t\t\t\t\t<li>Capability to work in collaboration with art lead, technical artist and programmers on implementation of UI design ideas</li>\r\n\t\t\t\t\t<li>Testing your work in-game and iterating based on feedback coming from testers and the team</li>\r\n\t\t\t\t\t<li>Understanding of graphics design, usability and practical approach for visual information presentation</li>\r\n\t\t\t\t\t<li>Knowledge of graphic editors, animation tools and prototyping tools</li>\r\n\t\t\t\t\t<li>Understanding videogame tech budget limitations</li>\r\n\t\t\t\t\t<li>Familiarity with Unity game engine and its UI tools</li>\r\n\t\t\t\t\t<li>Preparation of graphics assets and their in-game implementation into working systems</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<p class=\"list_heading\"><b>Nice to have:</b></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Technical knowledge, understanding of shaders and scripting language, knowledge of 3D software, deep knowledge of Unity components</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<p><b>Apply:</b></p>\r\n\t\t\t\t<p><a href=\"mailto:job@temporal.games\" class=\"mailto\">job@temporal.games</a></p>"
    },
    {
        "up": 29,
        "id": 36,
        "index": "",
        "name": "04",
        "title": "Data Scientist",
        "tags": "#engineering #full-time #remote #fluxcortex",
        "description": "Experienced data scientist interested in developing new advanced technologies related to simulating convincing human-like behavior in learning, motion, speech and decision making.",
        "page": "\r\n\t\t\t\t<p class=\"list_heading\"><b>Responsibilities:</b></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Take part in research to advance the state-of-the-art in virtual beings</li>\r\n\t\t\t\t\t<li>Develop new advanced technologies related to simulating convincing human-like behavior in learning, motion, speech and decision making</li>\r\n\t\t\t\t\t<li>Collaborate with the team to prototype solutions, experiments, and concepts</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<p class=\"list_heading\"><b>Requirements:</b></p>\r\n\t\t\t\t<ul>\r\n\t\t\t\t\t<li>Strong background in data science and machine learning engineering</li>\r\n\t\t\t\t\t<li>Knowledge of standard Python-based data science stack plus DL frameworks (e.g. PyTorch)</li>\r\n\t\t\t\t\t<li>Demonstrated software engineer experience via an internship, work experience, coding competitions, or widely used contributions in open source repositories (e.g. GitHub)</li>\r\n\t\t\t\t</ul>\r\n\t\t\t\t<p><b>Apply:</b></p>\r\n\t\t\t\t<p><a href=\"mailto:job@temporal.games\" class=\"mailto\">job@temporal.games</a></p>",
        "url": "data_scientist"
    },
    {
        "up": 29,
        "id": 37,
        "index": "",
        "name": "05",
        "title": "Other",
        "tags": "",
        "description": "If you don’t see your position listed but you think we can work together, feel free to contact us at <a href=\"mailto:job@temporal.games\" class=\"mailto\">job@temporal.games</a>, include your targeted position in the letter subject.",
        "page": "",
        "url": "other"
    }
]